EXAMP: PROC OPTIONS (MAIN);
DCL N BIN FIXED (31) INIT ( 111B );
DCL S BIN FIXED (31) INIT ( 100B );
DCL C BIN FIXED (31) INIT ( 101B );
DCL D BIN FIXED (31);
D = N + S - C;
DO 1 TO 2;
3;
END;
END EXAMP;
