EXAMP: PROC OPTIONS (MAIN);
DCL N BIN FIXED (31) INIT ( 111B );
DCL S BIN FIXED (31) INIT ( 100B );
DCL C BIN FIXED (31) INIT ( 101B );
DCL D BIN FIXED (31);
D = N + S - C;
DO N=13 TO 24, 42 TO 65;
N = S + C;
END;
END EXAMP;
